graph(%self.1 : __torch__.detectron2.export.flatten.TracingAdapter,
      %1 : Float(3, 800, 1067, strides=[1, 3201, 3], requires_grad=0, device=cpu)):
  %2 : __torch__.detectron2.modeling.meta_arch.rcnn.GeneralizedRCNN = prim::GetAttr[name="model"](%self.1)
  %3 : __torch__.detectron2.modeling.roi_heads.roi_heads.StandardROIHeads = prim::GetAttr[name="roi_heads"](%2)
  %4 : __torch__.detectron2.modeling.meta_arch.rcnn.GeneralizedRCNN = prim::GetAttr[name="model"](%self.1)
  %5 : __torch__.detectron2.modeling.proposal_generator.rpn.RPN = prim::GetAttr[name="proposal_generator"](%4)
  %6 : __torch__.detectron2.modeling.meta_arch.rcnn.GeneralizedRCNN = prim::GetAttr[name="model"](%self.1)
  %7 : __torch__.detectron2.modeling.backbone.fpn.FPN = prim::GetAttr[name="backbone"](%6)
  %8 : __torch__.detectron2.modeling.meta_arch.rcnn.GeneralizedRCNN = prim::GetAttr[name="model"](%self.1)
  %9 : Tensor = prim::GetAttr[name="pixel_std"](%8)
  %10 : __torch__.detectron2.modeling.meta_arch.rcnn.GeneralizedRCNN = prim::GetAttr[name="model"](%self.1)
  %11 : Tensor = prim::GetAttr[name="pixel_mean"](%10)
  %12 : Function = prim::Constant[name="move_device_like"]()
  %87 : NoneType = prim::Constant()
  %88 : bool = prim::Constant[value=0]()
  %89 : Device = prim::device(%11)
  %x.1 : Tensor = aten::to(%1, %89, %87, %88, %88) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:162:11
  %14 : int = prim::Constant[value=1]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/meta_arch/rcnn.py:242:0
  %15 : Float(3, 800, 1067, strides=[1, 3201, 3], requires_grad=0, device=cpu) = aten::sub(%x.1, %11, %14) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/meta_arch/rcnn.py:242:0
  %t : Float(3, 800, 1067, strides=[1, 3201, 3], requires_grad=0, device=cpu) = aten::div(%15, %9) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/meta_arch/rcnn.py:242:0
  %17 : int = prim::Constant[value=1]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:87:0
  %18 : int = aten::size(%t, %17) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:87:0
  %19 : Long(device=cpu) = prim::NumToTensor(%18)
  %20 : int = prim::Constant[value=2]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:87:0
  %21 : int = aten::size(%t, %20) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:87:0
  %22 : Long(device=cpu) = prim::NumToTensor(%21)
  %23 : Tensor[] = prim::ListConstruct(%19, %22)
  %24 : int = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:34:0
  %image_size : Long(2, strides=[1], requires_grad=0, device=cpu) = aten::stack(%23, %24) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:34:0
  %26 : Tensor[] = prim::ListConstruct(%image_size)
  %27 : int = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:89:0
  %28 : Long(1, 2, strides=[2, 1], requires_grad=0, device=cpu) = aten::stack(%26, %27) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:89:0
  %29 : int = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:89:0
  %30 : bool = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:89:0
  %max_size.1 : Long(2, strides=[1], requires_grad=0, device=cpu), %32 : Long(2, strides=[1], requires_grad=0, device=cpu) = aten::max(%28, %29, %30) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:89:0
  %33 : Long(requires_grad=0, device=cpu) = prim::Constant[value={31}]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:101:0
  %34 : int = prim::Constant[value=1]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:101:0
  %35 : Long(2, strides=[1], requires_grad=0, device=cpu) = aten::add(%max_size.1, %33, %34) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:101:0
  %36 : Long(requires_grad=0, device=cpu) = prim::Constant[value={32}]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:101:0
  %37 : str = prim::Constant[value="floor"]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:101:0
  %38 : Long(2, strides=[1], requires_grad=0, device=cpu) = aten::div(%35, %36, %37) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:101:0
  %39 : Long(requires_grad=0, device=cpu) = prim::Constant[value={32}]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:101:0
  %max_size : Long(2, strides=[1], requires_grad=0, device=cpu) = aten::mul(%38, %39) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:101:0
  %41 : int = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %42 : int = prim::Constant[value=-1]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %43 : Long(requires_grad=0, device=cpu) = aten::select(%max_size, %41, %42) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %44 : int = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %45 : int = prim::Constant[value=1]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %46 : Long(requires_grad=0, device=cpu) = aten::select(%image_size, %44, %45) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %47 : int = prim::Constant[value=1]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %48 : Long(requires_grad=0, device=cpu) = aten::sub(%43, %46, %47) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %49 : int = aten::Int(%48)
  %50 : int = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %51 : int = prim::Constant[value=-2]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %52 : Long(requires_grad=0, device=cpu) = aten::select(%max_size, %50, %51) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %53 : int = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %54 : int = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %55 : Long(requires_grad=0, device=cpu) = aten::select(%image_size, %53, %54) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %56 : int = prim::Constant[value=1]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %57 : Long(requires_grad=0, device=cpu) = aten::sub(%52, %55, %56) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:114:0
  %58 : int = aten::Int(%57)
  %59 : int = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:4153:0
  %60 : int = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:4153:0
  %61 : int[] = prim::ListConstruct(%59, %49, %60, %58)
  %62 : float = prim::Constant[value=0.]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:4153:0
  %63 : Float(3, 800, 1088, strides=[870400, 1088, 1], requires_grad=0, device=cpu) = aten::constant_pad_nd(%t, %61, %62) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:4153:0
  %64 : int = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:115:0
  %batched_imgs : Float(1, 3, 800, 1088, strides=[2611200, 870400, 1088, 1], requires_grad=0, device=cpu) = aten::unsqueeze_(%63, %64) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:115:0
  %66 : int = prim::Constant[value=0]() # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:129:0
  %x.3 : Float(1, 3, 800, 1088, strides=[2611200, 870400, 1088, 1], requires_grad=0, device=cpu) = aten::contiguous(%batched_imgs, %66) # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/structures/image_list.py:129:0
  %91 : float = prim::Constant[value=2.](), scope: __module.model.backbone # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:3690:0
  %92 : NoneType = prim::Constant(), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1
  %93 : int = prim::Constant[value=2](), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %94 : int = prim::Constant[value=3](), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %95 : int = prim::Constant[value=1](), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %96 : bool = prim::Constant[value=0](), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %97 : int = prim::Constant[value=0](), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %98 : bool = prim::Constant[value=1](), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %99 : float = prim::Constant[value=1.0000000000000001e-05](), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1/__module.model.backbone.bottom_up.stem.conv1.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %100 : float = prim::Constant[value=0.10000000000000001](), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1/__module.model.backbone.bottom_up.stem.conv1.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %101 : __torch__.detectron2.modeling.backbone.fpn.LastLevelMaxPool = prim::GetAttr[name="top_block"](%7)
  %102 : __torch__.detectron2.layers.wrappers.___torch_mangle_0.Conv2d = prim::GetAttr[name="fpn_output2"](%7)
  %103 : __torch__.detectron2.layers.wrappers.Conv2d = prim::GetAttr[name="fpn_lateral2"](%7)
  %104 : __torch__.detectron2.layers.wrappers.___torch_mangle_2.Conv2d = prim::GetAttr[name="fpn_output3"](%7)
  %105 : __torch__.detectron2.layers.wrappers.___torch_mangle_1.Conv2d = prim::GetAttr[name="fpn_lateral3"](%7)
  %106 : __torch__.detectron2.layers.wrappers.___torch_mangle_4.Conv2d = prim::GetAttr[name="fpn_output4"](%7)
  %107 : __torch__.detectron2.layers.wrappers.___torch_mangle_3.Conv2d = prim::GetAttr[name="fpn_lateral4"](%7)
  %108 : __torch__.detectron2.layers.wrappers.___torch_mangle_6.Conv2d = prim::GetAttr[name="fpn_output5"](%7)
  %109 : __torch__.detectron2.layers.wrappers.___torch_mangle_5.Conv2d = prim::GetAttr[name="fpn_lateral5"](%7)
  %110 : __torch__.detectron2.modeling.backbone.resnet.ResNet = prim::GetAttr[name="bottom_up"](%7)
  %111 : __torch__.torch.nn.modules.container.___torch_mangle_129.Sequential = prim::GetAttr[name="res5"](%110)
  %112 : __torch__.torch.nn.modules.container.___torch_mangle_105.Sequential = prim::GetAttr[name="res4"](%110)
  %113 : __torch__.torch.nn.modules.container.___torch_mangle_60.Sequential = prim::GetAttr[name="res3"](%110)
  %114 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="res2"](%110)
  %115 : __torch__.detectron2.modeling.backbone.resnet.BasicStem = prim::GetAttr[name="stem"](%110)
  %116 : __torch__.detectron2.layers.wrappers.___torch_mangle_7.Conv2d = prim::GetAttr[name="conv1"](%115)
  %117 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%116)
  %118 : Tensor = prim::GetAttr[name="weight"](%116)
  %119 : int[] = prim::ListConstruct(%93, %93), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1
  %120 : int[] = prim::ListConstruct(%94, %94), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1
  %121 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1
  %122 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1
  %input.1 : Float(1, 64, 400, 544, strides=[13926400, 217600, 544, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.3, %118, %92, %119, %120, %121, %96, %122, %95, %96, %96, %98, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %124 : Tensor = prim::GetAttr[name="running_var"](%117)
  %125 : Tensor = prim::GetAttr[name="running_mean"](%117)
  %126 : Tensor = prim::GetAttr[name="bias"](%117)
  %127 : Tensor = prim::GetAttr[name="weight"](%117)
  %x.5 : Float(1, 64, 400, 544, strides=[13926400, 217600, 544, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.1, %127, %126, %125, %124, %96, %100, %99, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem/__module.model.backbone.bottom_up.stem.conv1/__module.model.backbone.bottom_up.stem.conv1.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %input.3 : Float(1, 64, 400, 544, strides=[13926400, 217600, 544, 1], requires_grad=0, device=cpu) = aten::relu_(%x.5), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:357:0
  %130 : int[] = prim::ListConstruct(%94, %94), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem
  %131 : int[] = prim::ListConstruct(%93, %93), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem
  %132 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem
  %133 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem
  %x.7 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::max_pool2d(%input.3, %130, %131, %132, %133, %96), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.stem # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:718:0
  %135 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_29.BottleneckBlock = prim::GetAttr[name="2"](%114)
  %136 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_22.BottleneckBlock = prim::GetAttr[name="1"](%114)
  %137 : __torch__.detectron2.modeling.backbone.resnet.BottleneckBlock = prim::GetAttr[name="0"](%114)
  %138 : __torch__.detectron2.layers.wrappers.___torch_mangle_9.Conv2d = prim::GetAttr[name="shortcut"](%137)
  %139 : __torch__.detectron2.layers.wrappers.___torch_mangle_15.Conv2d = prim::GetAttr[name="conv3"](%137)
  %140 : __torch__.detectron2.layers.wrappers.___torch_mangle_13.Conv2d = prim::GetAttr[name="conv2"](%137)
  %141 : __torch__.detectron2.layers.wrappers.___torch_mangle_11.Conv2d = prim::GetAttr[name="conv1"](%137)
  %142 : __torch__.detectron2.layers.batch_norm.___torch_mangle_10.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%141)
  %143 : Tensor = prim::GetAttr[name="weight"](%141)
  %144 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv1
  %145 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv1
  %146 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv1
  %147 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv1
  %input.5 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.7, %143, %92, %144, %145, %146, %96, %147, %95, %96, %96, %98, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %149 : Tensor = prim::GetAttr[name="running_var"](%142)
  %150 : Tensor = prim::GetAttr[name="running_mean"](%142)
  %151 : Tensor = prim::GetAttr[name="bias"](%142)
  %152 : Tensor = prim::GetAttr[name="weight"](%142)
  %out.1 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.5, %152, %151, %150, %149, %96, %100, %99, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv1/__module.model.backbone.bottom_up.res2.0.conv1.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %x.9 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::relu_(%out.1), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:196:0
  %155 : __torch__.detectron2.layers.batch_norm.___torch_mangle_12.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%140)
  %156 : Tensor = prim::GetAttr[name="weight"](%140)
  %157 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv2
  %158 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv2
  %159 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv2
  %160 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv2
  %input.7 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.9, %156, %92, %157, %158, %159, %96, %160, %95, %96, %96, %98, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv2 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %162 : Tensor = prim::GetAttr[name="running_var"](%155)
  %163 : Tensor = prim::GetAttr[name="running_mean"](%155)
  %164 : Tensor = prim::GetAttr[name="bias"](%155)
  %165 : Tensor = prim::GetAttr[name="weight"](%155)
  %out.3 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.7, %165, %164, %163, %162, %96, %100, %99, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv2/__module.model.backbone.bottom_up.res2.0.conv2.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %x.11 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::relu_(%out.3), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:199:0
  %168 : __torch__.detectron2.layers.batch_norm.___torch_mangle_14.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%139)
  %169 : Tensor = prim::GetAttr[name="weight"](%139)
  %170 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv3
  %171 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv3
  %172 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv3
  %173 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv3
  %input.9 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.11, %169, %92, %170, %171, %172, %96, %173, %95, %96, %96, %98, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv3 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %175 : Tensor = prim::GetAttr[name="running_var"](%168)
  %176 : Tensor = prim::GetAttr[name="running_mean"](%168)
  %177 : Tensor = prim::GetAttr[name="bias"](%168)
  %178 : Tensor = prim::GetAttr[name="weight"](%168)
  %out.5 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.9, %178, %177, %176, %175, %96, %100, %99, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.conv3/__module.model.backbone.bottom_up.res2.0.conv3.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %180 : __torch__.detectron2.layers.batch_norm.___torch_mangle_8.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%138)
  %181 : Tensor = prim::GetAttr[name="weight"](%138)
  %182 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.shortcut
  %183 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.shortcut
  %184 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.shortcut
  %185 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.shortcut
  %input.11 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.7, %181, %92, %182, %183, %184, %96, %185, %95, %96, %96, %98, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.shortcut # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %187 : Tensor = prim::GetAttr[name="running_var"](%180)
  %188 : Tensor = prim::GetAttr[name="running_mean"](%180)
  %189 : Tensor = prim::GetAttr[name="bias"](%180)
  %190 : Tensor = prim::GetAttr[name="weight"](%180)
  %shortcut.1 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.11, %190, %189, %188, %187, %96, %100, %99, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0/__module.model.backbone.bottom_up.res2.0.shortcut/__module.model.backbone.bottom_up.res2.0.shortcut.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %out.7 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::add_(%out.5, %shortcut.1, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:208:0
  %x.13 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::relu_(%out.7), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.0 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:209:0
  %194 : __torch__.detectron2.layers.wrappers.___torch_mangle_21.Conv2d = prim::GetAttr[name="conv3"](%136)
  %195 : __torch__.detectron2.layers.wrappers.___torch_mangle_19.Conv2d = prim::GetAttr[name="conv2"](%136)
  %196 : __torch__.detectron2.layers.wrappers.___torch_mangle_17.Conv2d = prim::GetAttr[name="conv1"](%136)
  %197 : __torch__.detectron2.layers.batch_norm.___torch_mangle_16.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%196)
  %198 : Tensor = prim::GetAttr[name="weight"](%196)
  %199 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv1
  %200 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv1
  %201 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv1
  %202 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv1
  %input.13 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.13, %198, %92, %199, %200, %201, %96, %202, %95, %96, %96, %98, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %204 : Tensor = prim::GetAttr[name="running_var"](%197)
  %205 : Tensor = prim::GetAttr[name="running_mean"](%197)
  %206 : Tensor = prim::GetAttr[name="bias"](%197)
  %207 : Tensor = prim::GetAttr[name="weight"](%197)
  %out.9 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.13, %207, %206, %205, %204, %96, %100, %99, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv1/__module.model.backbone.bottom_up.res2.1.conv1.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %x.15 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::relu_(%out.9), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:196:0
  %210 : __torch__.detectron2.layers.batch_norm.___torch_mangle_18.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%195)
  %211 : Tensor = prim::GetAttr[name="weight"](%195)
  %212 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv2
  %213 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv2
  %214 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv2
  %215 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv2
  %input.15 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.15, %211, %92, %212, %213, %214, %96, %215, %95, %96, %96, %98, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv2 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %217 : Tensor = prim::GetAttr[name="running_var"](%210)
  %218 : Tensor = prim::GetAttr[name="running_mean"](%210)
  %219 : Tensor = prim::GetAttr[name="bias"](%210)
  %220 : Tensor = prim::GetAttr[name="weight"](%210)
  %out.11 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.15, %220, %219, %218, %217, %96, %100, %99, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv2/__module.model.backbone.bottom_up.res2.1.conv2.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %x.17 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::relu_(%out.11), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:199:0
  %223 : __torch__.detectron2.layers.batch_norm.___torch_mangle_20.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%194)
  %224 : Tensor = prim::GetAttr[name="weight"](%194)
  %225 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv3
  %226 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv3
  %227 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv3
  %228 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv3
  %input.17 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.17, %224, %92, %225, %226, %227, %96, %228, %95, %96, %96, %98, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv3 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %230 : Tensor = prim::GetAttr[name="running_var"](%223)
  %231 : Tensor = prim::GetAttr[name="running_mean"](%223)
  %232 : Tensor = prim::GetAttr[name="bias"](%223)
  %233 : Tensor = prim::GetAttr[name="weight"](%223)
  %out.13 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.17, %233, %232, %231, %230, %96, %100, %99, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1/__module.model.backbone.bottom_up.res2.1.conv3/__module.model.backbone.bottom_up.res2.1.conv3.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %out.15 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::add_(%out.13, %x.13, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:208:0
  %x.19 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::relu_(%out.15), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:209:0
  %237 : __torch__.detectron2.layers.wrappers.___torch_mangle_28.Conv2d = prim::GetAttr[name="conv3"](%135)
  %238 : __torch__.detectron2.layers.wrappers.___torch_mangle_26.Conv2d = prim::GetAttr[name="conv2"](%135)
  %239 : __torch__.detectron2.layers.wrappers.___torch_mangle_24.Conv2d = prim::GetAttr[name="conv1"](%135)
  %240 : __torch__.detectron2.layers.batch_norm.___torch_mangle_23.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%239)
  %241 : Tensor = prim::GetAttr[name="weight"](%239)
  %242 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv1
  %243 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv1
  %244 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv1
  %245 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv1
  %input.19 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.19, %241, %92, %242, %243, %244, %96, %245, %95, %96, %96, %98, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %247 : Tensor = prim::GetAttr[name="running_var"](%240)
  %248 : Tensor = prim::GetAttr[name="running_mean"](%240)
  %249 : Tensor = prim::GetAttr[name="bias"](%240)
  %250 : Tensor = prim::GetAttr[name="weight"](%240)
  %out.17 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.19, %250, %249, %248, %247, %96, %100, %99, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv1/__module.model.backbone.bottom_up.res2.2.conv1.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %x.21 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::relu_(%out.17), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:196:0
  %253 : __torch__.detectron2.layers.batch_norm.___torch_mangle_25.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%238)
  %254 : Tensor = prim::GetAttr[name="weight"](%238)
  %255 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv2
  %256 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv2
  %257 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv2
  %258 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv2
  %input.21 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.21, %254, %92, %255, %256, %257, %96, %258, %95, %96, %96, %98, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv2 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %260 : Tensor = prim::GetAttr[name="running_var"](%253)
  %261 : Tensor = prim::GetAttr[name="running_mean"](%253)
  %262 : Tensor = prim::GetAttr[name="bias"](%253)
  %263 : Tensor = prim::GetAttr[name="weight"](%253)
  %out.19 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.21, %263, %262, %261, %260, %96, %100, %99, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv2/__module.model.backbone.bottom_up.res2.2.conv2.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %x.23 : Float(1, 64, 200, 272, strides=[3481600, 54400, 272, 1], requires_grad=0, device=cpu) = aten::relu_(%out.19), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:199:0
  %266 : __torch__.detectron2.layers.batch_norm.___torch_mangle_27.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%237)
  %267 : Tensor = prim::GetAttr[name="weight"](%237)
  %268 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv3
  %269 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv3
  %270 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv3
  %271 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv3
  %input.23 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.23, %267, %92, %268, %269, %270, %96, %271, %95, %96, %96, %98, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv3 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %273 : Tensor = prim::GetAttr[name="running_var"](%266)
  %274 : Tensor = prim::GetAttr[name="running_mean"](%266)
  %275 : Tensor = prim::GetAttr[name="bias"](%266)
  %276 : Tensor = prim::GetAttr[name="weight"](%266)
  %out.21 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.23, %276, %275, %274, %273, %96, %100, %99, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2/__module.model.backbone.bottom_up.res2.2.conv3/__module.model.backbone.bottom_up.res2.2.conv3.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
  %out.23 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::add_(%out.21, %x.19, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:208:0
  %x.25 : Float(1, 256, 200, 272, strides=[13926400, 54400, 272, 1], requires_grad=0, device=cpu) = aten::relu_(%out.23), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res2/__module.model.backbone.bottom_up.res2.2 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/modeling/backbone/resnet.py:209:0
  %280 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_59.BottleneckBlock = prim::GetAttr[name="3"](%113)
  %281 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_52.BottleneckBlock = prim::GetAttr[name="2"](%113)
  %282 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_45.BottleneckBlock = prim::GetAttr[name="1"](%113)
  %283 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_38.BottleneckBlock = prim::GetAttr[name="0"](%113)
  %284 : __torch__.detectron2.layers.wrappers.___torch_mangle_31.Conv2d = prim::GetAttr[name="shortcut"](%283)
  %285 : __torch__.detectron2.layers.wrappers.___torch_mangle_37.Conv2d = prim::GetAttr[name="conv3"](%283)
  %286 : __torch__.detectron2.layers.wrappers.___torch_mangle_35.Conv2d = prim::GetAttr[name="conv2"](%283)
  %287 : __torch__.detectron2.layers.wrappers.___torch_mangle_33.Conv2d = prim::GetAttr[name="conv1"](%283)
  %288 : __torch__.detectron2.layers.batch_norm.___torch_mangle_32.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%287)
  %289 : Tensor = prim::GetAttr[name="weight"](%287)
  %290 : int[] = prim::ListConstruct(%93, %93), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res3/__module.model.backbone.bottom_up.res3.0/__module.model.backbone.bottom_up.res3.0.conv1
  %291 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res3/__module.model.backbone.bottom_up.res3.0/__module.model.backbone.bottom_up.res3.0.conv1
  %292 : int[] = prim::ListConstruct(%95, %95), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res3/__module.model.backbone.bottom_up.res3.0/__module.model.backbone.bottom_up.res3.0.conv1
  %293 : int[] = prim::ListConstruct(%97, %97), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res3/__module.model.backbone.bottom_up.res3.0/__module.model.backbone.bottom_up.res3.0.conv1
  %input.25 : Float(1, 128, 100, 136, strides=[1740800, 13600, 136, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.25, %289, %92, %290, %291, %292, %96, %293, %95, %96, %96, %98, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res3/__module.model.backbone.bottom_up.res3.0/__module.model.backbone.bottom_up.res3.0.conv1 # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/detectron2/layers/wrappers.py:128:0
  %295 : Tensor = prim::GetAttr[name="running_var"](%288)
  %296 : Tensor = prim::GetAttr[name="running_mean"](%288)
  %297 : Tensor = prim::GetAttr[name="bias"](%288)
  %298 : Tensor = prim::GetAttr[name="weight"](%288)
  %out.25 : Float(1, 128, 100, 136, strides=[1740800, 13600, 136, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.25, %298, %297, %296, %295, %96, %100, %99, %98), scope: __module.model.backbone/__module.model.backbone.bottom_up/__module.model.backbone.bottom_up.res3/__module.model.backbone.bottom_up.res3.0/__module.model.backbone.bottom_up.res3.0.conv1/__module.model.backbone.bottom_up.res3.0.conv1.norm # /root/miniconda3/envs/detectron/lib/python3.7/site-packages/torch/nn/functional.py:2282:0
